caixa-boleto-services/src/main/resources/templates/templateAlteraBoleto.xml

<soapenv:Envelope
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:ext="http://caixa.gov.br/sibar/manutencao_cobranca_bancaria/boleto/externo"
        xmlns:sib="http://caixa.gov.br/sibar">
    <soapenv:Header/>
    <soapenv:Body>
        <ext:SERVICO_ENTRADA>
            <sib:HEADER>
                <VERSAO>{header.versao}</VERSAO>
                <AUTENTICACAO>{header.autenticacao}</AUTENTICACAO>
                <USUARIO_SERVICO>{header.usuarioServico}</USUARIO_SERVICO>
                <OPERACAO>ALTERA_BOLETO</OPERACAO>
                <SISTEMA_ORIGEM>{header.sistemaOrigem}</SISTEMA_ORIGEM>
                <DATA_HORA>{header.dataHora}</DATA_HORA>
            </sib:HEADER>
            <DADOS>
                <ALTERA_BOLETO>
                    <CODIGO_BENEFICIARIO>{codigoBeneficiario}</CODIGO_BENEFICIARIO>
                    <TITULO>
                        <NOSSO_NUMERO>{titulo.nossoNumero}</NOSSO_NUMERO>
                        <NUMERO_DOCUMENTO>{titulo.numeroDocumento}</NUMERO_DOCUMENTO>
                        <DATA_VENCIMENTO>{titulo.dataVencimento}</DATA_VENCIMENTO>
                        <VALOR>{titulo.valor}</VALOR>
                        <TIPO_ESPECIE>{titulo.tipoEspecie}</TIPO_ESPECIE>
                        <FLAG_ACEITE>{titulo.flagAceite}</FLAG_ACEITE>
                        <JUROS_MORA>
                            <TIPO>{titulo.jurosMora.tipo}</TIPO>
                            <VALOR>{titulo.jurosMora.valor}</VALOR>
                        </JUROS_MORA>
                        <VALOR_ABATIMENTO>{titulo.valorAbatimento}</VALOR_ABATIMENTO>
                        <POS_VENCIMENTO>
                            <ACAO>{titulo.posVencimento.acao}</ACAO>
                            <NUMERO_DIAS>{titulo.posVencimento.numeroDias}</NUMERO_DIAS>
                        </POS_VENCIMENTO>
                        <PAGADOR>
                            {#if titulo.pagador.razaoSocial != null}
                            <RAZAO_SOCIAL>{titulo.pagador.razaoSocial}</RAZAO_SOCIAL>
                            {/if}
                            {#if titulo.pagador.nome != null}
                            <NOME>{titulo.pagador.nome}</NOME>
                            {/if}
                            <ENDERECO>
                                <LOGRADOURO>{titulo.pagador.endereco.logradouro}</LOGRADOURO>
                                <BAIRRO>{titulo.pagador.endereco.bairro}</BAIRRO>
                                <CIDADE>{titulo.pagador.endereco.cidade}</CIDADE>
                                <UF>{titulo.pagador.endereco.uf}</UF>
                                <CEP>{titulo.pagador.endereco.cep}</CEP>
                            </ENDERECO>
                        </PAGADOR>
                        <MULTA>
                            <DATA>{titulo.multa.data}</DATA>
                            <VALOR>{titulo.multa.valor}</VALOR>
                        </MULTA>
                        <DESCONTOS>
                            {#for desconto in titulo.descontos}
                            <DESCONTO>
                                <DATA>{desconto.data}</DATA>
                                <PERCENTUAL>{desconto.percentual}</PERCENTUAL>
                            </DESCONTO>
                            {/for}
                        </DESCONTOS>
                        <FICHA_COMPENSACAO>
                            <MENSAGENS>
                                {#for mensagem in titulo.fichaCompensacao.mensagens}
                                <MENSAGEM>{mensagem}</MENSAGEM>
                                {/for}
                            </MENSAGENS>
                        </FICHA_COMPENSACAO>
                        <RECIBO_PAGADOR>
                            <MENSAGENS>
                                {#for mensagem in titulo.reciboPagador.mensagens}
                                <MENSAGEM>{mensagem}</MENSAGEM>
                                {/for}
                            </MENSAGENS>
                        </RECIBO_PAGADOR>
                        <PAGAMENTO>
                            <QUANTIDADE_PERMITIDA>{titulo.pagamento.quantidadePermitidas}</QUANTIDADE_PERMITIDA>
                            <TIPO>{titulo.pagamento.tipo}</TIPO>
                            <VALOR_MINIMO>{titulo.pagamento.valorMinimo}</VALOR_MINIMO>
                            <VALOR_MAXIMO>{titulo.pagamento.valorMaximo}</VALOR_MAXIMO>
                        </PAGAMENTO>
                    </TITULO>
                </ALTERA_BOLETO>
            </DADOS>
        </ext:SERVICO_ENTRADA>
    </soapenv:Body>
</soapenv:Envelope>
